Terraform plan for __staging__
<details>
  <summary>Plan: 18 to add, 1 to change, 5 to destroy. Changes to Outputs.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_zone.zone[0] must be replaced
-/+ resource "aws_route53_zone" "zone" {
      + force_destroy = false
      ~ id            = "********************" -> (known after apply)
      ~ name          = "ssb-staging.datagov.us." -> "ssb-staging.data.gov" # forces replacement
      ~ name_servers  = [
          - "ns-1148.awsdns-15.org",
          - "ns-1937.awsdns-50.co.uk",
          - "ns-377.awsdns-47.com",
          - "ns-965.awsdns-56.net",
        ] -> (known after apply)
      - tags          = {} -> null
      + vpc_id        = (known after apply)
      + vpc_region    = (known after apply)
      ~ zone_id       = "********************" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-0263D0A3"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-0263D0A3"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 20
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-23414FF3"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-23414FF3"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 10
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-2AFB9258"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-2AFB9258"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 10
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-33415657"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-33415657"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 20
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-45FE3B85"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-45FE3B85"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 20
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-A4707A72"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-A4707A72"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 20
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-F678F1CE"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-F678F1CE"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 20
    }

  # aws_servicequotas_service_quota.minimum_quotas["vpc/L-FE5A380F"] will be created
  + resource "aws_servicequotas_service_quota" "minimum_quotas" {
      + adjustable     = (known after apply)
      + arn            = (known after apply)
      + default_value  = (known after apply)
      + id             = (known after apply)
      + quota_code     = "L-FE5A380F"
      + quota_name     = (known after apply)
      + request_id     = (known after apply)
      + request_status = (known after apply)
      + service_code   = "vpc"
      + service_name   = (known after apply)
      + value          = 20
    }

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id                             = (known after apply)
      + name                           = "ssb-k8s"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = (known after apply)
      + space                          = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags                           = [
          + "k8s",
        ]

      + timeouts {
          + create = "40m"
          + delete = "30m"
        }
    }

  # module.broker_aws.data.archive_file.app_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./app-ssb-aws.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./app-aws"
      + type                = "zip"
    }

  # module.broker_aws.data.cloudfoundry_domain.apps will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_domain" "apps"  {
      + domain     = (known after apply)
      + id         = (known after apply)
      + internal   = (known after apply)
      + name       = (known after apply)
      + org        = (known after apply)
      + sub_domain = "app"
    }

  # module.broker_aws.data.cloudfoundry_service.rds will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "rds"  {
      + id                  = (known after apply)
      + name                = "aws-rds"
      + service_broker_name = (known after apply)
      + service_plans       = (known after apply)
    }

  # module.broker_aws.data.cloudfoundry_space.broker_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "broker_space"  {
      + id       = (known after apply)
      + name     = "management-staging"
      + org      = (known after apply)
      + org_name = "gsa-datagov"
      + quota    = (known after apply)
    }

  # module.broker_aws.data.cloudfoundry_space.spaces["gsa-datagov/management-staging"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      + id       = (known after apply)
      + name     = "management-staging"
      + org      = (known after apply)
      + org_name = "gsa-datagov"
      + quota    = (known after apply)
    }

  # module.broker_aws.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-aws"
      + path                       = "./app-ssb-aws.zip"
      + ports                      = (known after apply)
      + source_code_hash           = (known after apply)
      + space                      = (known after apply)
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_aws.cloudfoundry_route.ssb_uri will be created
  + resource "cloudfoundry_route" "ssb_uri" {
      + domain   = (known after apply)
      + endpoint = (known after apply)
      + hostname = "ssb-aws-gsa-datagov-management-staging"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = (known after apply)
    }

  # module.broker_aws.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-aws-gsa-datagov-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = (known after apply)
      + url                              = (known after apply)
      + username                         = "b58981d5-215f-cf5f-6087-eb70a157581c"
    }

  # module.broker_aws.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-aws-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = (known after apply)
      + space                          = (known after apply)
      + tags                           = [
          + "mysql",
        ]
    }

  # module.broker_eks.data.archive_file.app_zip will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "app_zip"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "./app-ssb-eks.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "./app-eks"
      + type                = "zip"
    }

  # module.broker_eks.data.cloudfoundry_domain.apps will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_domain" "apps"  {
      + domain     = (known after apply)
      + id         = (known after apply)
      + internal   = (known after apply)
      + name       = (known after apply)
      + org        = (known after apply)
      + sub_domain = "app"
    }

  # module.broker_eks.data.cloudfoundry_service.rds will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_service" "rds"  {
      + id                  = (known after apply)
      + name                = "aws-rds"
      + service_broker_name = (known after apply)
      + service_plans       = (known after apply)
    }

  # module.broker_eks.data.cloudfoundry_space.broker_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "broker_space"  {
      + id       = (known after apply)
      + name     = "management-staging"
      + org      = (known after apply)
      + org_name = "gsa-datagov"
      + quota    = (known after apply)
    }

  # module.broker_eks.data.cloudfoundry_space.spaces["gsa-datagov/management-staging"] will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "spaces"  {
      + id       = (known after apply)
      + name     = "management-staging"
      + org      = (known after apply)
      + org_name = "gsa-datagov"
      + quota    = (known after apply)
    }

  # module.broker_eks.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                 = true -> false
      ~ environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      ~ health_check_timeout       = 0 -> (known after apply)
      ~ id                         = "************************************" -> (known after apply)
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-eks"
      ~ ports                      = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash           = "CLIecUHXBm4hr3cFUrklfEt6AWaJj8S1LuoZ63p0lQ0=" -> (known after apply)
      ~ space                      = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
      ~ stack                      = "ad34309f-ab24-4c3d-9ad1-eb0da8378bd4" -> (known after apply)
        # (10 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "9e8c7bd3-b996-4723-a8dc-0d23399715e9" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }

      ~ service_binding {
          - params           = (sensitive value)
          ~ service_instance = "59e8f0e3-c5aa-4b3c-9c8e-672c5805feae" -> (known after apply)
        }
    }

  # module.broker_eks.cloudfoundry_route.ssb_uri must be replaced
-/+ resource "cloudfoundry_route" "ssb_uri" {
      ~ domain   = "50ba3f69-cd54-4963-9172-14f3334b479e" -> (known after apply) # forces replacement
      ~ endpoint = "ssb-eks-gsa-datagov-management-staging.app.cloud.gov" -> (known after apply)
      ~ id       = "************************************" -> (known after apply)
      + port     = (known after apply)
      ~ space    = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.broker_eks.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] must be replaced
-/+ resource "cloudfoundry_service_broker" "space_scoped_broker" {
      ~ catalog_hash                     = "jAV_jEp-8QsKnQDfps-yPPwOoKw=" -> (known after apply)
      ~ id                               = "************************************" -> (known after apply)
        name                             = "ssb-eks-gsa-datagov-management-staging"
      ~ service_plans                    = {
          - "aws-eks-service/raw" = "36000c96-9efc-4143-97aa-6f1cfbe9a7ba"
        } -> (known after apply)
      ~ services                         = {
          - "aws-eks-service" = "43c8e6b8-1cf6-4d4a-9ad9-d227fd7d00ca"
        } -> (known after apply)
      ~ space                            = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
      ~ url                              = "https://ssb-eks-gsa-datagov-management-staging.app.cloud.gov" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.broker_eks.cloudfoundry_service_instance.db must be replaced
-/+ resource "cloudfoundry_service_instance" "db" {
      ~ id                             = "************************************" -> (known after apply)
        name                           = "ssb-eks-db"
      ~ service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae" -> (known after apply)
      ~ space                          = "5edc803e-3376-4788-b72c-a152f11925b0" -> (known after apply) # forces replacement
        tags                           = [
            "mysql",
        ]
        # (3 unchanged attributes hidden)
    }

  # module.broker_solr.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                   = "087db748-497f-4c57-945b-25ec516ccf51"
      ~ id_bg                = "************************************" -> (known after apply)
        name                 = "ssb-solr"
        # (17 unchanged attributes hidden)


      + service_binding {
          + service_instance = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 18 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  ~ route53_zone_nameservers = [
      - [
          - "ns-1148.awsdns-15.org",
          - "ns-1937.awsdns-50.co.uk",
          - "ns-377.awsdns-47.com",
          - "ns-965.awsdns-56.net",
        ],
      + (known after apply),
    ]
```
</details>

Plan generated in [plan #60](https://github.com/GSA/datagov-ssb/actions/runs/746233931)